#ifndef FONT16X16_H
#define	FONT16X16_H
/* -------------------------------------------------------------------------- */
/*		Font Processing Table for Korean Character						      */
/* -------------------------------------------------------------------------- */

//  2 바이트 조합형 한글:
// 
// |        First Byte             |  |          Second Byte          |
// |                               |  |                               |
//    7   6   5   4   3   2   1   0      7   6   5   4   3   2   1   0
// +---+---+---+---+---+---+---+---+  +---+---+---+---+---+---+---+---+
// | 1 |   |   |   |   |   |   |   |  |   |   |   |   |   |   |   |   |
// +---+---+---+---+---+---+---+---+  +---+---+---+---+---+---+---+---+
//   |   |               |   |                  |   |               |
//   |   +---------------+   +------------------+   +---------------+
//   |         초성                  중성                  종성
//   |
// MSB(한글(1)/영문(0) 표시)

// 전체자수 :
// 받침 없는 글자 : 초성(19) x 중성(21) = 399 자
// 받침 있는 글자 : 초성(19) x 중성(21) x 종성(27) = 10,773 자 
//---------------------------------------------------------------------------

// 초성 : 자음(14) + 쌍자음(5) = 19 개
unsigned char __flash table_cho[21] =
	{0,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19};

// 중성 : 자음(10) + 쌍자음(11) = 21 개
unsigned char __flash table_joong[30] =
	{0,0,0,1,2,3,4,5,0,0,6,7,8,9,10,11,0,0,12,13,14,15,16,17,0,0,18,19,20,21};

// 종성 : 자음(14) + 쌍자음(11) + 쌍자음(2) = 27 개
unsigned char __flash table_jong[30] =
	{0,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,0,17,18,19,20,21,22,23,24,25,26,27};

// 벌수
unsigned char __flash bul_cho1[22] =
	{0,0,0,0,0,0,0,0,0,1,3,3,3,1,2,4,4,4,2,1,3,0};
unsigned char __flash bul_cho2[22] =
	{0,5,5,5,5,5,5,5,5,6,7,7,7,6,6,7,7,7,6,6,7,5};
unsigned char __flash bul_jong[22] =
	{0,0,2,0,2,1,2,1,2,3,0,2,1,3,3,1,2,1,3,3,1,1};
/*
// 유니코드 한글 자모
//초성 
prog_uint16_t uni_cho[19] = {
	0x1100, 0x1101, 0x1102, 0x1103, 0x1104,	// ㄱ, ㄲ, ㄴ, ㄷ, ㄸ
	0x1105, 0x1106, 0x1107, 0x1108, 0x1109,	// ㄹ, ㅁ, ㅂ, ㅃ, ㅅ
	0x110A, 0x110B, 0x110C, 0x110D, 0x110E,	// ㅆ, ㅇ, ㅈ, ㅉ, ㅊ
	0x110F, 0x1110, 0x1111, 0x1112};		// ㅋ, ㅌ, ㅍ, ㅎ


//중성 
prog_uint16_t uni_joong[21] = {
	0x1161, 0x1162, 0x1163, 0x1164, 0x1165,	// ㅏ, ㅐ, ㅑ, ㅒ, ㅓ
	0x1166, 0x1167, 0x1168, 0x1169, 0x116A,	// ㅔ, ㅕ, ㅖ, ㅗ, ㅘ
	0x116B, 0x116C, 0x116D, 0x116E, 0x116F,	// ㅙ, ㅚ, ㅛ, ㅜ, ㅝ
	0x1170, 0x1171, 0x1172, 0x1173, 0x1174,	// ㅞ, ㅟ, ㅠ, ㅡ, ㅢ
	0x1175};								// ㅣ

//종성 
prog_uint16_t uni_jong[28] = {
	0x0000, 0x11A8, 0x11A9, 0x11AA, 0x11AB,	//     ㄱ, ㄲ, ㄳ, ㄴ
	0x11AC, 0x11AD, 0x11AE, 0x11AF, 0x11B0,	// ㄵ, ㄶ, ㄷ, ㄹ, ㄺ
	0x11B1, 0x11B2, 0x11B3, 0x11B4, 0x11B5,	// ㄻ, ㄼ, ㄽ, ㄾ, ㄿ
	0x11B6, 0x11B7, 0x11B8, 0x11B9, 0x11BA,	// ㅀ, ㅁ, ㅂ, ㅄ, ㅅ
	0x11BB, 0x11BC, 0x11BD, 0x11BE, 0x11BF,	// ㅆ, ㅇ, ㅈ, ㅊ, ㅋ
	0x11C0, 0x11C1, 0x11C2};				// ㅌ, ㅍ, ㅎ
*/
//#include "ks_table.h"	// 완성형 테이블

/* -------------------------------------------------------------------------- */
/*		한글폰트 선택														  */
/* -------------------------------------------------------------------------- */
//#define FONT_KOR_IYAGI	// 이야기체 선택
//#define FONT_KOR_PILGI	// 필기체 선택
//#define FONT_KOR_HMGOTH	// 휴먼고딕체 선택
#define FONT_KOR_MGOTH	// 중간고딕체 선택

//#include "font_kor_iyagi.h"
//#include "font_kor_pilgi.h"
//#include "font_kor_hmgoth.h"
#include "font_kor_mgoth.h"

#endif
